var TAG_MASTER_SOURCE = [
    [1, "初期", 1],
    [2, "エリート", 2],
    [3, "上級エリート", 4],
    [4, "近距離", 8],
    [5, "遠距離", 16],
    [6, "前衛タイプ", 32],
    [7, "医療タイプ", 64],
    [8, "先鋒タイプ", 128],
    [9, "術士タイプ", 256],
    [10, "狙撃タイプ", 512],
    [11, "重装タイプ", 1024],
    [12, "補助タイプ", 2048],
    [13, "特殊タイプ", 4096],
    [14, "治療", 8192],
    [15, "支援", 16384],
    [16, "火力", 32768],
    [17, "範囲攻撃", 65536],
    [18, "減速", 131072],
    [19, "生存", 262144],
    [20, "防御", 524288],
    [21, "弱化", 1048576],
    [22, "強制移動", 2097152],
    [23, "牽制", 4194304],
    [24, "爆発力", 8388608],
    [25, "召喚", 16777216],
    [26, "高速再配置", 33554432],
    [27, "COST回復", 67108864],
    [28, "ロボット", 134217728],
];

var UNIT_MASTER_SOURCE = [
    ["二アール", 1, 5, ""],
    ["グム", 2, 4, ""],
    ["メテオリーテ", 3, 5, ""],
    ["シラユキ", 4, 4, ""],
    ["スペクター", 5, 5, ""],
    ["エステル", 6, 4, "公開求人限定"],
    ["エフイーター", 7, 5, ""],
    ["フロストリーフ", 8, 4, ""],
    ["イースチナ", 9, 5, ""],
    ["ジェシカ", 10, 4, ""],
    ["ズィマー", 11, 5, ""],
    ["ワルファリン", 12, 5, ""],
    ["フィリオプシス", 13, 5, ""],
    ["マンティコア", 14, 5, ""],
    ["クリフハート", 15, 5, ""],
    ["リスカム", 16, 5, ""],
    ["ヴァルカン", 17, 5, "公開求人限定"],
    ["プラマニクス", 18, 5, ""],
    ["クロワッサン", 19, 5, ""],
];

var PATTERN_MASTER_SOURCE = [
    [1, 8192, 525320, ""],
    [2, 8192, 525320, ""],
    [3, 65536, 512, ""],
    [4, 65536, 512, ""],
    [5, 65536, 262184, ""],
    [6, 65536, 262184, ""],
    [7, 131072, 8, ""],
    [8, 131072, 8, ""],
    [8, 131072, 32, ""],
    [9, 131072, 32768, ""],
    [8, 131072, 32768, ""],
    [4, 131072, 66048, ""],
    [10, 262144, 528, ""],
    [11, 16384, 67108992, ""],
    [12, 16384, 8272, ""],
    [13, 16384, 8272, ""],
    [9, 32768, 2048, ""],
    [14, 32768, 4096, ""],
    [15, 32768, 4096, ""],
    [15, 32768, 2097152, ""],
    [16, 32768, 525312, ""],
    [17, 32768, 525312, ""],
    [7, 131072, 2101248, ""],
    [14, 262144, 4096, ""],
    [17, 262144, 525312, ""],
    [18, 1048576, 2048, ""],
    [3, 1048576, 65536, ""],
    [19, 2097152, 525312, ""],
];

var TagMaster = {};
TAG_MASTER_SOURCE.forEach(function(row) {
    TagMaster[row[0]] = {
        id: row[0],
        name: row[1],
        flag: row[2],
    };
});

var UnitMaster = {};
UNIT_MASTER_SOURCE.forEach(function(row) {
    UnitMaster[row[1]] = {
        id: row[1],
        name: row[0],
        rarity: row[2],
        note: row[3],
    };
})

var PatternMaster = {};
PATTERN_MASTER_SOURCE.forEach(function(row, index) {
    PatternMaster[index] = {
        id: index,
        unitId: row[0],
        essentialFlags: row[1],
        optionalFlags: row[2],
        note: row[3],
    }
})

function onBodyLoaded() {
    console.log("hello");
    console.log(TagMaster);
    console.log(UnitMaster);
    console.log(PatternMaster);
}
